netsuite/netsuite-connector/netsuite-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/netsuite/api_addList_negative.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:urn="urn:messages_2014_1.platform.webservices.netsuite.com"
                  xmlns:urn1="urn:core_2014_1.platform.webservices.netsuite.com"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <urn:passport>
            <urn1:email>%s(email)</urn1:email>
            <urn1:password>%s(password)</urn1:password>
            <urn1:account>%s(account)</urn1:account>
        </urn:passport>
    </soapenv:Header>
    <soapenv:Body>

        <urn:addList>
            <platformMsgs:record xmlns:RecordRef="urn:core_2014_1.platform.webservices.netsuite.com"
                                 xmlns:listRel="urn:relationships_2014_1.lists.webservices.netsuite.com"
                                 xsi:type="listRel:Customer"
                                 xmlns:platformMsgs="urn:messages_2014_1.platform.webservices.netsuite.com"
                                 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                <listRel:entityId>%s(customerNameMandatory)</listRel:entityId>
                <listRel:companyName>%s(companyName)</listRel:companyName>
                <listRel:subsidiary>
                    <RecordRef:internalId>%s(subsidiaryId)</RecordRef:internalId>
                    <RecordRef:type>subsidiary</RecordRef:type>
                </listRel:subsidiary>
            </platformMsgs:record>
        </urn:addList>
    </soapenv:Body>
</soapenv:Envelope>